In [ ]:
#**9. Write a Pandas program to create a Pivot table and find the total sale amount region wise, manager wise, sales man wise.**

In [1]:
import pandas as pd

df = pd.read_csv('Sales_data.csv')

pivot_table = df.pivot_table(index=['Region', 'Manager', 'SalesMan'], values='Sale_amt', aggfunc='sum')

print(pivot_table)

                           Sale_amt
Region  Manager SalesMan
Central Hermann Luis       150948.0
                Shelli      25000.0
                Sigal      107820.0
        Martha  Alexander   57266.0
                Steven      89850.0
        Timothy David        6075.0
East    Douglas John          250.0
                Karen       40500.0
        Hermann Sigal       14000.0
        Martha  Alexander  173810.0
                Diana       14500.0
West    Douglas Michael     38336.0
        Timothy Stephen     67088.0

#**10.Create a dataframe of ten rows, four columns with random values. Write a Pandas program to highlight the negative numbers red and positive numbers black.**

In [2]:
import pandas as pd
import numpy as np

data = np.random.randn(10, 4)
df = pd.DataFrame(data, columns=['A', 'B', 'C', 'D'])

def color_negative_red(val):
    color = 'red' if val < 0 else 'black'
    return f'color: {color}'

styled_df = df.style.applymap(color_negative_red)

styled_df

#**11.Create a dataframe of ten rows, four columns with random values. Convert some values to nan values. Write a Pandas program which will highlight the nan values.**

In [ ]:
import pandas as pd
import numpy as np

data = np.random.randn(10, 4)
df = pd.DataFrame(data, columns=['A', 'B', 'C', 'D'])

df.iloc[2, 1] = np.nan
df.iloc[5, 3] = np.nan
df.iloc[7, 0] = np.nan

def highlight_nan(val):
    return f'background-color: yellow' if pd.isna(val) else ''

styled_df = df.style.applymap(highlight_nan)

styled_df

#**12.Create a dataframe of ten rows, four columns with random values. Write a Pandas program to set dataframe background Color black and font color yellow.**

In [3]:
import pandas as pd
import numpy as np

data = np.random.randn(10, 4)
df = pd.DataFrame(data, columns=['A', 'B', 'C', 'D'])

def set_styles(val):
    return f'background-color: black; color: yellow;'

styled_df = df.style.applymap(set_styles)

styled_df

#**13.Write a Pandas program to detect missing values of a given DataFrame. Display True or False.**

In [4]:
import pandas as pd
import numpy as np
data = {
'ord_no':[70001,np.nan,70002,70004,np.nan,70005,np.nan,70010,70003,70012,np.nan,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10',np.nan,'2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3002,3001,3001,3003,3002,3001,3001,3004,3003,3002,3001,3001],
'salesman_id':[5002,5003,5001,np.nan,5002,5001,5001,np.nan,5003,5002,5003,np.nan]}
df =pd.DataFrame(data)
missing_values = df.isna()
print(missing_values)

    ord_no  purch_amt  ord_date  customer_id  salesman_id
0    False      False     False        False        False
1     True      False     False        False        False
2    False      False      True        False        False
3    False      False     False        False         True
4     True      False     False        False        False
5    False      False     False        False        False
6     True      False     False        False        False
7    False      False     False        False         True
8    False      False     False        False        False
9    False      False     False        False        False
10    True      False     False        False        False
11   False      False     False        False         True

#**14. Write a Pandas program to find and replace the missing values in a given DataFrame which do not have any valuable information.**

In [1]:
import pandas as pd
data=pd.read_csv('customer_id.csv')
missing_values=data.fillna(0)
print(missing_values)

     ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50  2012-10-05         3002       5002.0
1       0.0     270.65  2012-09-10         3001       5003.0
2   70002.0      65.26           0         3001       5001.0
3   70004.0     110.50  2012-08-17         3003          0.0
4       0.0     948.50  2012-09-10         3002       5002.0
5   70005.0    2400.60  2012-07-27         3001       5001.0
6       0.0    5760.00  2012-09-10         3001       5001.0
7   70010.0    1983.43  2012-10-10         3004          0.0
8   70003.0    2480.40  2012-10-10         3003       5003.0
9   70012.0     250.45  2012-06-27         3002       5002.0
10      0.0      75.29  2012-08-17         3001       5003.0
11  70013.0    3045.60  2012-04-25         3001          0.0

#**15.Write a Pandas program to keep the rows with at least 2 NaN values in a given DataFrame.**

In [6]:
import pandas as pd

# Provide the correct file path for your Excel file.
df = pd.read_excel('purchase_data.csv.xlsx')

# Continue with your data processing as needed.
nan_values = df.isna().sum(axis=1)
df = df[nan_values >= 2]
print(df)

    Unnamed: 0  ord_no  purch_amt ord_date  customer_id
0            0     NaN        NaN      NaN          NaN
3            3     NaN        NaN      NaN          NaN
11          11     NaN        NaN      NaN          NaN

#**16.Write a Pandas program to split the following dataframe into groups based on school code. Also check the type of GroupBy object.**

In [2]:
import pandas as pd
data=pd.read_csv('school_data.csv')
grouped = data.groupby('school')
print(grouped)
print(type(grouped))

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7c8a453df9a0>
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>